---
kind: method
id: M:Autodesk.Revit.DB.ParameterFilterElement.GetCategories
source: html/7e497437-277e-8e15-bdc5-9065d868f464.htm
---
# Autodesk.Revit.DB.ParameterFilterElement.GetCategories Method

Gets the categories admitted by this filter.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetCategories()
```